# -*- coding: utf-8 -*-

SPECIAL_CASES = [
    [
        u"الف لام ميم",
        u"الم",
        [[2, 1], [3, 1], [29, 1], [30, 1], [31, 1], [32, 1]]
    ],
    [u"الف لام ميم صاد", u"المص", [[7, 1]]],
    [u"الافلام الرو", u"الر", [[10, 1], [11, 1], [12, 1], [14, 1], [15, 1]]],
    [u"الف لام لو", u"الر", [[10, 1], [11, 1], [12, 1], [14, 1], [15, 1]]],
    [u"الف لام رو", u"الر", [[10, 1], [11, 1], [12, 1], [14, 1], [15, 1]]],
    [u"الف لام راء", u"الر", [[10, 1], [11, 1], [12, 1], [14, 1], [15, 1]]],
    [u"الافلام راء", u"الر", [[10, 1], [11, 1], [12, 1], [14, 1], [15, 1]]],
    [u"الف لام ميم لا", u"المر", [[13, 1]]],
    [u"الف لام ميم رو", u"المر", [[13, 1]]],
    [u"الف لام ميم لو", u"المر", [[13, 1]]],
    [u"الف لام ميم راء", u"المر", [[13, 1]]],
    [u"كيف حالك يا عين صوت", u"كهيعص", [[19, 1]]],
    [u"كيف حالك يا عين صوتك", u"كهيعص", [[19, 1]]],
    [u"كاف ها يا عين صوتك", u"كهيعص", [[19, 1]]],
    [u"كيف حالك يا عين صاد", u"كهيعص", [[19, 1]]],
    [u"كاف ها يا عين صاد", u"كهيعص", [[19, 1]]],
    [u"كيف ها يا عين صاد", u"كهيعص", [[19, 1]]],
    [u"كاف ها يا عين صوت", u"كهيعص", [[19, 1]]],
    [u"طاحا", u"طه", [[20, 1]]],
    [u"طا حا", u"طه", [[20, 1]]],
    [u"توحه", u"طه", [[20, 1]]],
    [u"طاء حاء", u"طه", [[20, 1]]],
    [u"طا سين ميم", u"طسم", [[26, 1], [28, 1]]],
    [u"طا سين", u"طس", [[27, 1]]],
    [u"طاء سين", u"طس", [[27, 1]]],
    [u"يا فين", u"يس", [[36, 1]]],
    [u"ياسين", u"يس", [[36, 1]]],
    [u"يا سين", u"يس", [[36, 1]]],
    [u"صوت", u"ص", [[38, 1]]],
    [u"صادق", u"ص", [[38, 1]]],
    [u"صدى", u"ص", [[38, 1]]],
    [u"صاد", u"ص", [[38, 1]]],
    [
        u"حاء ميم",
        u"حم",
        [[40, 1], [41, 1], [42, 1], [43, 1], [44, 1], [45, 1], [46, 1]]
    ],
    [
        u"حاميم",
        u"حم",
        [[40, 1], [41, 1], [42, 1], [43, 1], [44, 1], [45, 1], [46, 1]]
    ],
    [
        u"حا ميم",
        u"حم",
        [[40, 1], [41, 1], [42, 1], [43, 1], [44, 1], [45, 1], [46, 1]]
    ],
    [
        u"حا مين",
        u"حم",
        [[40, 1], [41, 1], [42, 1], [43, 1], [44, 1], [45, 1], [46, 1]]
    ],
    [
        u"ها ميم",
        u"حم",
        [[40, 1], [41, 1], [42, 1], [43, 1], [44, 1], [45, 1], [46, 1]]
    ],
    [
        u"ها مين",
        u"حم",
        [[40, 1], [41, 1], [42, 1], [43, 1], [44, 1], [45, 1], [46, 1]]
    ],
    [u"عين سين قاف", u"عسق", [[42, 2]]],
    [u"عين فين قاف", u"عسق", [[42, 2]]],
    [u"اين فين قاف", u"عسق", [[42, 2]]],
    [u"اين فين قاص", u"عسق", [[42, 2]]],
    [u"قاف", u"ق", [[50, 1]]],
    [u"نون", u"ن", [[68, 1]]],
]
